{
    "movies":{
       "0":{
          "title":"O Poderoso Chefão",
          "description":"O Poderoso Chefão é um filme de crime de 1972 dirigido por Francis Ford Coppola e produzido por Albert S. Ruddy, com roteiro baseado no romance de 1969 de Mario Puzo. É estrelado por Marlon Brando, Al Pacino, James Caan, Richard S. Castellano, Robert Duvall, Sterling Hayden, John Marley, Richard Conte e Diane Keaton.",
          "image":"https://upload.wikimedia.org/wikipedia/pt/thumb/d/de/Godfather_1972.jpg/250px-Godfather_1972.jpg",
          "stars":5,
          "duration":"2h 58m",
          "gender":"Crime"
       },
       "1":{
          "title":"Shang-Chi e a Lenda dos Dez Anéis",
          "description":"Shang-Chi e a Lenda dos Dez Anéis é um filme de super-herói americano de 2021 baseado no personagem da Marvel Comics Shang-Chi. Produzido pela Marvel Studios e distribuído pela Walt Disney Studios Motion Pictures, é o 25º filme do Universo Cinematográfico Marvel (MCU).",
          "image":"https://upload.wikimedia.org/wikipedia/pt/thumb/7/74/Shang-Chi_and_the_Legend_of_the_Ten_Rings_poster.jpeg/250px-Shang-Chi_and_the_Legend_of_the_Ten_Rings_poster.jpeg",
          "stars":4,
          "duration":"2h 12m",
          "gender":"Ação/Aventura"
       },
       "2":{
          "title":"Loki",
          "description":"Loki é uma série de televisão americana criada por Michael Waldron para o serviço de streaming Disney+, baseada no personagem da Marvel Comics de mesmo nome. Situado no Universo Cinematográfico Marvel (MCU), compartilha continuidade com os filmes da franquia e ocorre após os eventos de Vingadores: Ultimato (2019).",
          "image":"https://cdn.europosters.eu/image/1300/posters/marvel-loki-i127940.jpg",
          "stars":4,
          "duration":"6h 8m",
          "gender":"Ação/Aventura"
       },
       "3":{
          "title":"Cruella",
          "description":"Cruella é um filme de comédia dramática americano de 2021 dirigido por Craig Gillespie com roteiro de Dana Fox e Tony McNamara, de uma história de Aline Brosh McKenna, Kelly Marcel e Steve Zissis. Baseado no personagem Cruella de Vil da novela The Hundred and One Dalmatians de Dodie Smith, é uma prequela de 101 Dálmatas (1996).",
          "image":"https://upload.wikimedia.org/wikipedia/pt/f/f6/Cruella_2021_film_poster.jpg",
          "stars":4,
          "duration":"2h 14m",
          "gender":"Comédia"
       },
       "4":{
          "title":"Spider-man: No Way Home",
          "description":"Spider-Man: No Way Home (bra: Homem-Aranha: Sem Volta para Casa; prt: Homem-Aranha: Sem Volta a Casa)[4][5] é um filme norte-americano de super-herói de 2021 baseado no personagem Homem-Aranha da Marvel Comics, co-produzido pela Columbia Pictures e Marvel Studios, e distribuído pela Sony Pictures Releasing. É a sequência de Spider-Man: Homecoming (2017) e Spider-Man: Far From Home (2019), e o vigésimo sétimo filme do Universo Cinematográfico Marvel (UCM).",
          "image":"https://upload.wikimedia.org/wikipedia/pt/thumb/0/00/Spider-Man_No_Way_Home_poster.jpg/250px-Spider-Man_No_Way_Home_poster.jpg",
          "stars":5,
          "duration":"2h 28m",
          "gender":"Ação/Aventura"
       }
    }
 }